<!-- dflook/terraform-github-actions {"workspace":"ghes-graphql-2","backend_type":"remote","backend":"927c3419a21b02ca48307f0a0612a1a0b544c25ed9bfcaacd260a9808e6c71cc","plan_job_ref":"Job Test Terraform cloud #171 at https://github.com/dflook/terraform-github-actions/actions/runs/5563632283","plan_hash":"e8b44a7ddc8b31110023dd6fadaf9e0c6b7eab4737c067563c74829db85c8f53","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __ghes-graphql-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.the_id will be created
  + resource "random_id" "the_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + default        = "default"
  + from_tfvars    = "from_tfvars"
  + from_variables = "from_variables"
```
</details>

:memo: Plan generated in [Test Terraform cloud #171](https://github.com/dflook/terraform-github-actions/actions/runs/5563632283)